# app.py
import streamlit as st

st.set_page_config(
    page_title="Лабораторная работа №1",
    layout="wide"
)

st.title("Лабораторная работа №1")
st.write("### Определение параметров за косым скачком уплотнения на клине с использованием численных методов решения нелинейных уравнений.")
st.write("---")
st.write("**Выполнил:** Андриянов Э.В., группа М8О-412Б-22")
st.write("**Вариант:** 6")

st.sidebar.title("Параметры варианта №6")
st.sidebar.markdown("""
**Задание 1:**
- `p1`, Па: `165000`
- `T1`, К: `300`
- `М1`: `4`
- `β`, ˚: `15`
- **Метод:** Метод секущих
""")

st.sidebar.markdown("""
**Задание 2:**
- **Уравнение:** `e^x - x - 2 = 0`
- **Отрезок [a, b]:** `[-2, -1]`
- **Метод:** Метод Ньютона
""")
st.sidebar.markdown("---")


pages = {
    "Задание №1": [st.Page("pages/shock_wave.py", title="Задача о скачке уплотнения", icon="✈️")],
    "Задание №2": [st.Page("pages/solver.py", title="Решение уравнения", icon="🧮")],
    "Задание №3": [st.Page("pages/benchmark.py", title="Сравнение методов", icon="📊")],
}

pg = st.navigation(pages)
pg.run()